In [1]:
from pyspark.sql import SparkSession

In [2]:
spark_session = SparkSession.builder.getOrCreate()

24/02/17 18:37:24 WARN Utils: Your hostname, laptop resolves to a loopback address: 127.0.1.1; using 192.168.208.108 instead (on interface wlo1)
24/02/17 18:37:24 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
24/02/17 18:37:25 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [3]:
data = [
    {"id": 1, "name": "shreyas", "age": 34, "place": "India"},
    {"id": 2, "name": "ankit", "age": 30, "place": "USA"},
    {"id": 3, "name": "james", "age": 24, "place": "France"},
    {"id": 4, "name": "johnson", "age": 38, "place": "Australia"},
    {"id": 5, "name": "sachin", "age": 28, "place": "India"},
    {"id": 6, "name": "smith", "age": 27, "place": "Australia"},
    {"id": 7, "name": "andrew", "age": 33, "place": "USA"},
    {"id": 7, "name": "andrew", "age": 33, "place": "USA"},
    {"id": 8, "name": "stephen", "age": None, "place": None},
    {"id": 9, "name": "sebastian", "age": None, "place": "Italy"},
]

df1 = spark_session.createDataFrame(data)

In [4]:
df1.show(df1.count(), truncate=False)

+----+---+---------+---------+
|age |id |name     |place    |
+----+---+---------+---------+
|34  |1  |shreyas  |India    |
|30  |2  |ankit    |USA      |
|24  |3  |james    |France   |
|38  |4  |johnson  |Australia|
|28  |5  |sachin   |India    |
|27  |6  |smith    |Australia|
|33  |7  |andrew   |USA      |
|33  |7  |andrew   |USA      |
|NULL|8  |stephen  |NULL     |
|NULL|9  |sebastian|Italy    |
+----+---+---------+---------+

In [5]:
df1.printSchema()

root
 |-- age: long (nullable = true)
 |-- id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- place: string (nullable = true)

In [6]:
new_data = [
    {"id": 1, "profession": "doctor"},
    {"id": 2, "profession": "Buisnessman"},
    {"id": 3, "profession": "Engineer"},
    {"id": 4, "profession": "scientist"},
    {"id": 5, "profession": "doctor"},
    {"id": 10, "profession": "Manager"},
    {"id": 11, "profession": "Accountant"},
]

df2 = spark_session.createDataFrame(new_data)

In [7]:
df2.show(df2.count(), truncate=False)

+---+-----------+
|id |profession |
+---+-----------+
|1  |doctor     |
|2  |Buisnessman|
|3  |Engineer   |
|4  |scientist  |
|5  |doctor     |
|10 |Manager    |
|11 |Accountant |
+---+-----------+

In [8]:
#join() to join two dataframes based "on" column and joing type "how" 
df = df1.join(df2, on="id", how="left")
df.show(df.count(), truncate=False)

print("*"*50)
print("RIGHT JOIN")
df = df1.join(df2, on="id", how="right_outer")
df.show(df.count(), truncate=False)

print("*"*50)
print("FULL JOIN")
df = df1.join(df2, on="id", how="full_outer")
df.show(df.count(), truncate=False)

print("*"*50)
print("INNER JOIN")
df = df1.join(df2, on="id", how="inner")
df.show(df.count(), truncate=False)

print("*"*50)
print("LEFT SEMI JOIN")
dff = df1.join(df2, on="id", how="left_semi")
dff.show(dff.count(), truncate=False)

print("*"*50)
print("LEFT ANTI JOIN")
dff = df1.join(df2, on="id", how="left_anti")
dff.show(dff.count(), truncate=False)

+---+----+---------+---------+-----------+
|id |age |name     |place    |profession |
+---+----+---------+---------+-----------+
|1  |34  |shreyas  |India    |doctor     |
|2  |30  |ankit    |USA      |Buisnessman|
|3  |24  |james    |France   |Engineer   |
|5  |28  |sachin   |India    |doctor     |
|4  |38  |johnson  |Australia|scientist  |
|6  |27  |smith    |Australia|NULL       |
|7  |33  |andrew   |USA      |NULL       |
|7  |33  |andrew   |USA      |NULL       |
|9  |NULL|sebastian|Italy    |NULL       |
|8  |NULL|stephen  |NULL     |NULL       |
+---+----+---------+---------+-----------+

**************************************************
RIGHT JOIN

+---+----+-------+---------+-----------+
|id |age |name   |place    |profession |
+---+----+-------+---------+-----------+
|1  |34  |shreyas|India    |doctor     |
|2  |30  |ankit  |USA      |Buisnessman|
|3  |24  |james  |France   |Engineer   |
|4  |38  |johnson|Australia|scientist  |
|5  |28  |sachin |India    |doctor     |
|10 |NULL|NULL   |NULL     |Manager    |
|11 |NULL|NULL   |NULL     |Accountant |
+---+----+-------+---------+-----------+

**************************************************
FULL JOIN

+---+----+---------+---------+-----------+
|id |age |name     |place    |profession |
+---+----+---------+---------+-----------+
|1  |34  |shreyas  |India    |doctor     |
|2  |30  |ankit    |USA      |Buisnessman|
|3  |24  |james    |France   |Engineer   |
|4  |38  |johnson  |Australia|scientist  |
|5  |28  |sachin   |India    |doctor     |
|6  |27  |smith    |Australia|NULL       |
|7  |33  |andrew   |USA      |NULL       |
|7  |33  |andrew   |USA      |NULL       |
|8  |NULL|stephen  |NULL     |NULL       |
|9  |NULL|sebastian|Italy    |NULL       |
|10 |NULL|NULL     |NULL     |Manager    |
|11 |NULL|NULL     |NULL     |Accountant |
+---+----+---------+---------+-----------+

**************************************************
INNER JOIN

+---+---+-------+---------+-----------+
|id |age|name   |place    |profession |
+---+---+-------+---------+-----------+
|1  |34 |shreyas|India    |doctor     |
|2  |30 |ankit  |USA      |Buisnessman|
|3  |24 |james  |France   |Engineer   |
|4  |38 |johnson|Australia|scientist  |
|5  |28 |sachin |India    |doctor     |
+---+---+-------+---------+-----------+

**************************************************
LEFT SEMI JOIN

+---+---+-------+---------+
|id |age|name   |place    |
+---+---+-------+---------+
|1  |34 |shreyas|India    |
|2  |30 |ankit  |USA      |
|3  |24 |james  |France   |
|4  |38 |johnson|Australia|
|5  |28 |sachin |India    |
+---+---+-------+---------+

**************************************************
LEFT ANTI JOIN

+---+----+---------+---------+
|id |age |name     |place    |
+---+----+---------+---------+
|6  |27  |smith    |Australia|
|7  |33  |andrew   |USA      |
|7  |33  |andrew   |USA      |
|9  |NULL|sebastian|Italy    |
|8  |NULL|stephen  |NULL     |
+---+----+---------+---------+

In [9]:
#dropDuplicates() to drop the duplicate entries based on given subset
updated_df = df.dropDuplicates(subset=["id"])

In [10]:
updated_df.show(df.count(), truncate=False)

+---+---+-------+---------+-----------+
|id |age|name   |place    |profession |
+---+---+-------+---------+-----------+
|1  |34 |shreyas|India    |doctor     |
|2  |30 |ankit  |USA      |Buisnessman|
|3  |24 |james  |France   |Engineer   |
|4  |38 |johnson|Australia|scientist  |
|5  |28 |sachin |India    |doctor     |
+---+---+-------+---------+-----------+

In [11]:
from pyspark.sql.functions import avg, min, max, sum, sum_distinct, count, count_distinct

#use groupBy() for grouping and performing aggregation on columns based on grouped data
df1.groupBy(["place"]).agg({'age': 'avg'}).show()

# count()
df1.groupBy(["place"]).count().show()

# avg()
df1.groupBy(["place"]).min("age").show()

# multiple aggegation functions for agg()
df1.groupBy(["place"]).agg(avg("age").alias("avg_age"),
                                  min("age").alias("min_age"),
                                  max("age").alias("max_age"),
                                  count("age").alias("count_age"),
                                  count_distinct("age").alias("distinct_count_age"),
                                  sum("age").alias("sum_age"),
                                  sum_distinct("age").alias("distinct_sum_age")).show()

# perform aggregation on columns without grouping
df1.select(avg("age"), count("age"), count_distinct("age"), min("age"), max("age"),
                  sum("age"), sum_distinct("age")).show()

+---------+--------+
|    place|avg(age)|
+---------+--------+
|    India|    31.0|
|      USA|    32.0|
|   France|    24.0|
|Australia|    32.5|
|     NULL|    NULL|
|    Italy|    NULL|
+---------+--------+

+---------+-----+
|    place|count|
+---------+-----+
|    India|    2|
|      USA|    3|
|   France|    1|
|Australia|    2|
|     NULL|    1|
|    Italy|    1|
+---------+-----+

+---------+--------+
|    place|min(age)|
+---------+--------+
|    India|      28|
|      USA|      30|
|   France|      24|
|Australia|      27|
|     NULL|    NULL|
|    Italy|    NULL|
+---------+--------+

+---------+-------+-------+-------+---------+------------------+-------+----------------+
|    place|avg_age|min_age|max_age|count_age|distinct_count_age|sum_age|distinct_sum_age|
+---------+-------+-------+-------+---------+------------------+-------+----------------+
|   France|   24.0|     24|     24|        1|                 1|     24|              24|
|     NULL|   NULL|   NULL|   NULL|        0|                 0|   NULL|            NULL|
|    India|   31.0|     28|     34|        2|                 2|     62|              62|
|    Italy|   NULL|   NULL|   NULL|        0|                 0|   NULL|            NULL|
|      USA|   32.0|     30|     33|        3|                 2|     96|              63|
|Australia|   32.5|     27|     38|        2|                 2|     65|              65|
+---------+-------+-------+-------+---------+------------------+-------+----------------+

+--------+----------+-------------------+--------+--------+--------+-----------------+
|avg(age)|count(age)|count(DISTINCT age)|min(age)|max(age)|sum(age)|sum(DISTINCT age)|
+--------+----------+-------------------+--------+--------+--------+-----------------+
|  30.875|         8|                  7|      24|      38|     247|              214|
+--------+----------+-------------------+--------+--------+--------+-----------------+

In [12]:
# using dropna to drop null values
new_df = spark_session.createDataFrame(data, schema=["age", "id", "name", "place"])
new_df.show()

# If ‘any’, drop a row if it contains any nulls. If ‘all’, drop a row only if all its values are null.
new_df.dropna(subset=["place", "age"], how="any").show()
new_df.dropna(subset=["place", "age"], how="all").show()

+----+---+---------+---------+
| age| id|     name|    place|
+----+---+---------+---------+
|  34|  1|  shreyas|    India|
|  30|  2|    ankit|      USA|
|  24|  3|    james|   France|
|  38|  4|  johnson|Australia|
|  28|  5|   sachin|    India|
|  27|  6|    smith|Australia|
|  33|  7|   andrew|      USA|
|  33|  7|   andrew|      USA|
|NULL|  8|  stephen|     NULL|
|NULL|  9|sebastian|    Italy|
+----+---+---------+---------+

+---+---+-------+---------+
|age| id|   name|    place|
+---+---+-------+---------+
| 34|  1|shreyas|    India|
| 30|  2|  ankit|      USA|
| 24|  3|  james|   France|
| 38|  4|johnson|Australia|
| 28|  5| sachin|    India|
| 27|  6|  smith|Australia|
| 33|  7| andrew|      USA|
| 33|  7| andrew|      USA|
+---+---+-------+---------+

+----+---+---------+---------+
| age| id|     name|    place|
+----+---+---------+---------+
|  34|  1|  shreyas|    India|
|  30|  2|    ankit|      USA|
|  24|  3|    james|   France|
|  38|  4|  johnson|Australia|
|  28|  5|   sachin|    India|
|  27|  6|    smith|Australia|
|  33|  7|   andrew|      USA|
|  33|  7|   andrew|      USA|
|NULL|  9|sebastian|    Italy|
+----+---+---------+---------+

In [13]:
# here we can use where() instead of filter, both are same
#using filter() for filtering of data 
updated_df.filter(~(updated_df["profession"]=='doctor') & ~(updated_df["age"]> 25)).show(updated_df.count(), truncate=False)

# filter using startswith()
updated_df.filter(updated_df["profession"].startswith('d')).show(updated_df.count(), truncate=False)

# filter using endswith()
updated_df.filter(updated_df["profession"].endswith('st')).show(updated_df.count(), truncate=False)

# filter using like()
updated_df.filter(updated_df["name"].like('ja%')).show(updated_df.count(), truncate=False)

# filter using contains()
updated_df.filter(updated_df["profession"].contains("doc")).show(updated_df.count(), truncate=False)

# filter using isin()
li = ["scientist", "Engineer"]
updated_df.filter(updated_df["profession"].isin(li)).show(updated_df.count(), truncate=False)

+---+---+-----+------+----------+
|id |age|name |place |profession|
+---+---+-----+------+----------+
|3  |24 |james|France|Engineer  |
+---+---+-----+------+----------+

+---+---+-------+-----+----------+
|id |age|name   |place|profession|
+---+---+-------+-----+----------+
|1  |34 |shreyas|India|doctor    |
|5  |28 |sachin |India|doctor    |
+---+---+-------+-----+----------+

+---+---+-------+---------+----------+
|id |age|name   |place    |profession|
+---+---+-------+---------+----------+
|4  |38 |johnson|Australia|scientist |
+---+---+-------+---------+----------+

+---+---+-----+------+----------+
|id |age|name |place |profession|
+---+---+-----+------+----------+
|3  |24 |james|France|Engineer  |
+---+---+-----+------+----------+

+---+---+-------+-----+----------+
|id |age|name   |place|profession|
+---+---+-------+-----+----------+
|1  |34 |shreyas|India|doctor    |
|5  |28 |sachin |India|doctor    |
+---+---+-------+-----+----------+

+---+---+-------+---------+----------+
|id |age|name   |place    |profession|
+---+---+-------+---------+----------+
|3  |24 |james  |France   |Engineer  |
|4  |38 |johnson|Australia|scientist |
+---+---+-------+---------+----------+

In [14]:
# Select column names for display
updated_df.select(updated_df["name"], updated_df["age"], updated_df["place"], updated_df["profession"]).show(updated_df.count(), False)
print("*"*50)

# OR
updated_df.select(["name", "age", "place", "profession"]).show(updated_df.count(), False)

+-------+---+---------+-----------+
|name   |age|place    |profession |
+-------+---+---------+-----------+
|shreyas|34 |India    |doctor     |
|ankit  |30 |USA      |Buisnessman|
|james  |24 |France   |Engineer   |
|johnson|38 |Australia|scientist  |
|sachin |28 |India    |doctor     |
+-------+---+---------+-----------+

**************************************************

+-------+---+---------+-----------+
|name   |age|place    |profession |
+-------+---+---------+-----------+
|shreyas|34 |India    |doctor     |
|ankit  |30 |USA      |Buisnessman|
|james  |24 |France   |Engineer   |
|johnson|38 |Australia|scientist  |
|sachin |28 |India    |doctor     |
+-------+---+---------+-----------+

In [15]:
data = [
    ("shreyas", 34, "India"),
    ("ankit", 30, "USA"),
    ("james", 24, "France"),
    ("johnson", 38, "Australia"),
    ("sachin", 28, "India"),
    ("smith", 27, "Australia"),
    ("andrew", 33, "USA"),
    ("stephen", None, None),
    ("sebastian", None, "Italy"),
]

schema = ["name", "age", "place"]

# Create RDD using sparkContext.parallelize()
rdd_data = spark_session.sparkContext.parallelize(data)
print(rdd_data)

ParallelCollectionRDD[453] at readRDDFromFile at PythonRDD.scala:289

In [16]:
#Convert RDD to Dataframe using toDF()
print("Using toDF() to convert RDD to dataframe....")
rdd_converted_toDF = rdd_data.toDF(schema=schema)

rdd_converted_toDF.printSchema()
rdd_converted_toDF.show(rdd_converted_toDF.count(), truncate=False)

Using toDF() to convert RDD to dataframe....
root
 |-- name: string (nullable = true)
 |-- age: long (nullable = true)
 |-- place: string (nullable = true)

+---------+----+---------+
|name     |age |place    |
+---------+----+---------+
|shreyas  |34  |India    |
|ankit    |30  |USA      |
|james    |24  |France   |
|johnson  |38  |Australia|
|sachin   |28  |India    |
|smith    |27  |Australia|
|andrew   |33  |USA      |
|stephen  |NULL|NULL     |
|sebastian|NULL|Italy    |
+---------+----+---------+

In [17]:
#Convert RDD to Dataframe using createDataFrame()
print("Using createDataFrame() to convert RDD to dataframe....")
rdd_converted_createDataFrame = spark_session.createDataFrame(rdd_data, schema=schema)

rdd_converted_createDataFrame.printSchema()
rdd_converted_createDataFrame.show(rdd_converted_createDataFrame.count(), truncate=False)

Using createDataFrame() to convert RDD to dataframe....
root
 |-- name: string (nullable = true)
 |-- age: long (nullable = true)
 |-- place: string (nullable = true)

+---------+----+---------+
|name     |age |place    |
+---------+----+---------+
|shreyas  |34  |India    |
|ankit    |30  |USA      |
|james    |24  |France   |
|johnson  |38  |Australia|
|sachin   |28  |India    |
|smith    |27  |Australia|
|andrew   |33  |USA      |
|stephen  |NULL|NULL     |
|sebastian|NULL|Italy    |
+---------+----+---------+

In [18]:
# convert to pyspark dataframe into pandas dataframe
pandas_df = rdd_converted_createDataFrame.toPandas()
print(pandas_df)

        name   age      place
0    shreyas  34.0      India
1      ankit  30.0        USA
2      james  24.0     France
3    johnson  38.0  Australia
4     sachin  28.0      India
5      smith  27.0  Australia
6     andrew  33.0        USA
7    stephen   NaN       None
8  sebastian   NaN      Italy

In [19]:
# distinct() is similar to dropDuplicates() but we can't select columns while dropping duplicates
print("Data before using distinct()...")
df.show(df.count(), truncate=False)

# distinct() to get distinct rows
print("Data after using distinct()...")
distinct_df = df.distinct()
distinct_df.show(distinct_df.count(), truncate=False)

Data before using distinct()...

+---+---+-------+---------+-----------+
|id |age|name   |place    |profession |
+---+---+-------+---------+-----------+
|1  |34 |shreyas|India    |doctor     |
|2  |30 |ankit  |USA      |Buisnessman|
|3  |24 |james  |France   |Engineer   |
|4  |38 |johnson|Australia|scientist  |
|5  |28 |sachin |India    |doctor     |
+---+---+-------+---------+-----------+

Data after using distinct()...

+---+---+-------+---------+-----------+
|id |age|name   |place    |profession |
+---+---+-------+---------+-----------+
|1  |34 |shreyas|India    |doctor     |
|2  |30 |ankit  |USA      |Buisnessman|
|3  |24 |james  |France   |Engineer   |
|4  |38 |johnson|Australia|scientist  |
|5  |28 |sachin |India    |doctor     |
+---+---+-------+---------+-----------+

In [20]:
#sort() and orderBy() to sort data
sorted_df = updated_df.orderBy(["name", "place"], ascending=[True, False])
sorted_df.show(sorted_df.count(), truncate=False)

#sort
sorted_df = updated_df.sort(["name", "place"], ascending=[True, False])
sorted_df.show(sorted_df.count(), truncate=False)

+---+---+-------+---------+-----------+
|id |age|name   |place    |profession |
+---+---+-------+---------+-----------+
|2  |30 |ankit  |USA      |Buisnessman|
|3  |24 |james  |France   |Engineer   |
|4  |38 |johnson|Australia|scientist  |
|5  |28 |sachin |India    |doctor     |
|1  |34 |shreyas|India    |doctor     |
+---+---+-------+---------+-----------+

+---+---+-------+---------+-----------+
|id |age|name   |place    |profession |
+---+---+-------+---------+-----------+
|2  |30 |ankit  |USA      |Buisnessman|
|3  |24 |james  |France   |Engineer   |
|4  |38 |johnson|Australia|scientist  |
|5  |28 |sachin |India    |doctor     |
|1  |34 |shreyas|India    |doctor     |
+---+---+-------+---------+-----------+

In [21]:
# fillna() to fill null values in dataframe
updated_df = df.fillna(subset=["name", "place"], value="unknown")
updated_df.show(updated_df.count(), truncate=False)

+---+---+-------+---------+-----------+
|id |age|name   |place    |profession |
+---+---+-------+---------+-----------+
|1  |34 |shreyas|India    |doctor     |
|2  |30 |ankit  |USA      |Buisnessman|
|3  |24 |james  |France   |Engineer   |
|4  |38 |johnson|Australia|scientist  |
|5  |28 |sachin |India    |doctor     |
+---+---+-------+---------+-----------+

In [22]:
# drop() to drop columns in dataframe
updated_df1 = df.drop("name", "age")
updated_df1.show(updated_df1.count(), truncate=False)

+---+---------+-----------+
|id |place    |profession |
+---+---------+-----------+
|1  |India    |doctor     |
|2  |USA      |Buisnessman|
|3  |France   |Engineer   |
|4  |Australia|scientist  |
|5  |India    |doctor     |
+---+---------+-----------+

In [23]:
# replace() to replace value with specific value in dataframe
updated_df = df.replace(subset=["name"], to_replace="andrew", value="Andrew")
updated_df.show(updated_df.count(), truncate=False)

+---+---+-------+---------+-----------+
|id |age|name   |place    |profession |
+---+---+-------+---------+-----------+
|1  |34 |shreyas|India    |doctor     |
|2  |30 |ankit  |USA      |Buisnessman|
|3  |24 |james  |France   |Engineer   |
|4  |38 |johnson|Australia|scientist  |
|5  |28 |sachin |India    |doctor     |
+---+---+-------+---------+-----------+

In [24]:
# use head() to display n rows from first
df1 = df
df1.head(3)

[Row(id=1, age=34, name='shreyas', place='India', profession='doctor'),
 Row(id=2, age=30, name='ankit', place='USA', profession='Buisnessman'),
 Row(id=3, age=24, name='james', place='France', profession='Engineer')]

In [25]:
# use tail() to display n rows from last
df2 = df
df2.tail(3)

[Row(id=3, age=24, name='james', place='France', profession='Engineer'),
 Row(id=4, age=38, name='johnson', place='Australia', profession='scientist'),
 Row(id=5, age=28, name='sachin', place='India', profession='doctor')]

In [26]:
# to get columns and number of columns
print(df.columns)
print(len(df.columns))

['id', 'age', 'name', 'place', 'profession']
5

In [27]:
# describe() to show statistics results
df.describe('age').show()

+-------+-----------------+
|summary|              age|
+-------+-----------------+
|  count|                5|
|   mean|             30.8|
| stddev|5.403702434442519|
|    min|               24|
|    max|               38|
+-------+-----------------+

In [28]:
# count of distinct places
df.select(['place']).distinct().count()

4

In [29]:
# Calculate Pair-wise Frequency of Categorical Columns using crosstab()
df.crosstab("place", "profession").show()

+----------------+-----------+--------+------+---------+
|place_profession|Buisnessman|Engineer|doctor|scientist|
+----------------+-----------+--------+------+---------+
|          France|          0|       1|     0|        0|
|           India|          0|       0|     2|        0|
|             USA|          1|       0|     0|        0|
|       Australia|          0|       0|     0|        1|
+----------------+-----------+--------+------+---------+

In [30]:
# read csv file as df with chaining of options

csv_data1 = spark_session.read.option("header", True) \
                             .option("inferSchema", True) \
                             .option("delimiter", ",") \
                             .csv("/home/laptop/Downloads/employee.csv")

csv_data1.show()

+---+--------+------+---+-----------------+-------+
| id|    name|salary|age|      designation|dept_id|
+---+--------+------+---+-----------------+-------+
|  1|   Edith|100000| 35|Software Engineer|      2|
|  2|  tyrion|120000| 25|       Programmer|      4|
|  3|     jon| 51000| 37|  System Engineer|      4|
|  4|daenerys| 70000| 31|        Developer|      1|
|  5|    Andy| 20000| 41| Senior Developer|      2|
|  6|    Luis| 40000| 25|        Developer|      3|
|  7|  Keshav| 50000| 36|       Programmer|      2|
|  8|   david| 60000| 42|  System Engineer|      1|
|  9|  Madhav| 40000| 22|Software Engineer|      3|
| 10|   Jadav| 70000| 32|Software Engineer|   NULL|
+---+--------+------+---+-----------------+-------+

In [31]:
# read csv file as df without chaining of options

csv_data2 = spark_session.read.options(header='True', inferSchema='True', delimiter=',') \
                             .csv("/home/laptop/Downloads/employee.csv")

csv_data2.show()

+---+--------+------+---+-----------------+-------+
| id|    name|salary|age|      designation|dept_id|
+---+--------+------+---+-----------------+-------+
|  1|   Edith|100000| 35|Software Engineer|      2|
|  2|  tyrion|120000| 25|       Programmer|      4|
|  3|     jon| 51000| 37|  System Engineer|      4|
|  4|daenerys| 70000| 31|        Developer|      1|
|  5|    Andy| 20000| 41| Senior Developer|      2|
|  6|    Luis| 40000| 25|        Developer|      3|
|  7|  Keshav| 50000| 36|       Programmer|      2|
|  8|   david| 60000| 42|  System Engineer|      1|
|  9|  Madhav| 40000| 22|Software Engineer|      3|
| 10|   Jadav| 70000| 32|Software Engineer|   NULL|
+---+--------+------+---+-----------------+-------+

In [32]:
# read folder containing csv files as df
csv_data3 = spark_session.read.option("header", True).csv("/home/laptop/Downloads/csv_files/")
csv_data3.show(10, truncate=False)

+----------+------------+-------+------------+------+--------------+
|Date      |Decimal Date|Average|Interpolated|Trend |Number of Days|
+----------+------------+-------+------------+------+--------------+
|1958-03-01|1958.208    |315.71 |315.71      |314.62|-1            |
|1958-04-01|1958.292    |317.45 |317.45      |315.29|-1            |
|1958-05-01|1958.375    |317.50 |317.50      |314.71|-1            |
|1958-06-01|1958.458    |-99.99 |317.10      |314.85|-1            |
|1958-07-01|1958.542    |315.86 |315.86      |314.98|-1            |
|1958-08-01|1958.625    |314.93 |314.93      |315.94|-1            |
|1958-09-01|1958.708    |313.20 |313.20      |315.91|-1            |
|1958-10-01|1958.792    |-99.99 |312.66      |315.61|-1            |
|1958-11-01|1958.875    |313.33 |313.33      |315.31|-1            |
|1958-12-01|1958.958    |314.67 |314.67      |315.61|-1            |
+----------+------------+-------+------------+------+--------------+
only showing top 10 rows

In [33]:
# write df to csv
csv_data2.write.options(inferSchema='True', delimiter=',', header='True') \
                   .mode("ignore").csv('/home/laptop/Downloads/test')

In [34]:
# write df to parquet file without partition
csv_data1.write.mode("overwrite").parquet("/home/laptop/Downloads/test1")

In [35]:
# write df to paraquet file using partitionBy()
csv_data1.write.partitionBy("age").mode("overwrite").parquet("/home/laptop/Downloads/test2")

In [36]:
# read parquet file containing partition
parquet_data1 = spark_session.read.parquet("/home/laptop/Downloads/test2/age=25/")
parquet_data1.show()

+---+------+------+-----------+-------+
| id|  name|salary|designation|dept_id|
+---+------+------+-----------+-------+
|  2|tyrion|120000| Programmer|      4|
|  6|  Luis| 40000|  Developer|      3|
+---+------+------+-----------+-------+

In [37]:
csv_data2.show()

# withColumnRenamed()
column_renamed = csv_data2.withColumnRenamed("name", "employee_name") \
                          .withColumnRenamed("age", "employee_age") \
                          .withColumnRenamed("salary", "employee_salary")

column_renamed.show()

+---+--------+------+---+-----------------+-------+
| id|    name|salary|age|      designation|dept_id|
+---+--------+------+---+-----------------+-------+
|  1|   Edith|100000| 35|Software Engineer|      2|
|  2|  tyrion|120000| 25|       Programmer|      4|
|  3|     jon| 51000| 37|  System Engineer|      4|
|  4|daenerys| 70000| 31|        Developer|      1|
|  5|    Andy| 20000| 41| Senior Developer|      2|
|  6|    Luis| 40000| 25|        Developer|      3|
|  7|  Keshav| 50000| 36|       Programmer|      2|
|  8|   david| 60000| 42|  System Engineer|      1|
|  9|  Madhav| 40000| 22|Software Engineer|      3|
| 10|   Jadav| 70000| 32|Software Engineer|   NULL|
+---+--------+------+---+-----------------+-------+

+---+-------------+---------------+------------+-----------------+-------+
| id|employee_name|employee_salary|employee_age|      designation|dept_id|
+---+-------------+---------------+------------+-----------------+-------+
|  1|        Edith|         100000|          35|Software Engineer|      2|
|  2|       tyrion|         120000|          25|       Programmer|      4|
|  3|          jon|          51000|          37|  System Engineer|      4|
|  4|     daenerys|          70000|          31|        Developer|      1|
|  5|         Andy|          20000|          41| Senior Developer|      2|
|  6|         Luis|          40000|          25|        Developer|      3|
|  7|       Keshav|          50000|          36|       Programmer|      2|
|  8|        david|          60000|          42|  System Engineer|      1|
|  9|       Madhav|          40000|          22|Software Engineer|      3|
| 10|        Jadav|          70000|          32|Software Engineer|   NULL|
+---+-------------+---------------+------------+-----------------+-------+

In [38]:
csv_data2.show()

# to rename all columns using toDF()
columns = ["emp_id", "emp_name", "emp_salary", "emp_age", "emp_designation", "dept_id"]
all_columns_renamed = csv_data2.toDF(*columns)
all_columns_renamed.show()

+---+--------+------+---+-----------------+-------+
| id|    name|salary|age|      designation|dept_id|
+---+--------+------+---+-----------------+-------+
|  1|   Edith|100000| 35|Software Engineer|      2|
|  2|  tyrion|120000| 25|       Programmer|      4|
|  3|     jon| 51000| 37|  System Engineer|      4|
|  4|daenerys| 70000| 31|        Developer|      1|
|  5|    Andy| 20000| 41| Senior Developer|      2|
|  6|    Luis| 40000| 25|        Developer|      3|
|  7|  Keshav| 50000| 36|       Programmer|      2|
|  8|   david| 60000| 42|  System Engineer|      1|
|  9|  Madhav| 40000| 22|Software Engineer|      3|
| 10|   Jadav| 70000| 32|Software Engineer|   NULL|
+---+--------+------+---+-----------------+-------+

+------+--------+----------+-------+-----------------+-------+
|emp_id|emp_name|emp_salary|emp_age|  emp_designation|dept_id|
+------+--------+----------+-------+-----------------+-------+
|     1|   Edith|    100000|     35|Software Engineer|      2|
|     2|  tyrion|    120000|     25|       Programmer|      4|
|     3|     jon|     51000|     37|  System Engineer|      4|
|     4|daenerys|     70000|     31|        Developer|      1|
|     5|    Andy|     20000|     41| Senior Developer|      2|
|     6|    Luis|     40000|     25|        Developer|      3|
|     7|  Keshav|     50000|     36|       Programmer|      2|
|     8|   david|     60000|     42|  System Engineer|      1|
|     9|  Madhav|     40000|     22|Software Engineer|      3|
|    10|   Jadav|     70000|     32|Software Engineer|   NULL|
+------+--------+----------+-------+-----------------+-------+

In [39]:
all_columns_renamed.show()

# withColumn() to add new column by utilizing existing column
hiked_salary = all_columns_renamed.withColumn("hiked_salary", all_columns_renamed['emp_salary']* 1.50)
hiked_salary.show()

+------+--------+----------+-------+-----------------+-------+
|emp_id|emp_name|emp_salary|emp_age|  emp_designation|dept_id|
+------+--------+----------+-------+-----------------+-------+
|     1|   Edith|    100000|     35|Software Engineer|      2|
|     2|  tyrion|    120000|     25|       Programmer|      4|
|     3|     jon|     51000|     37|  System Engineer|      4|
|     4|daenerys|     70000|     31|        Developer|      1|
|     5|    Andy|     20000|     41| Senior Developer|      2|
|     6|    Luis|     40000|     25|        Developer|      3|
|     7|  Keshav|     50000|     36|       Programmer|      2|
|     8|   david|     60000|     42|  System Engineer|      1|
|     9|  Madhav|     40000|     22|Software Engineer|      3|
|    10|   Jadav|     70000|     32|Software Engineer|   NULL|
+------+--------+----------+-------+-----------------+-------+

+------+--------+----------+-------+-----------------+-------+------------+
|emp_id|emp_name|emp_salary|emp_age|  emp_designation|dept_id|hiked_salary|
+------+--------+----------+-------+-----------------+-------+------------+
|     1|   Edith|    100000|     35|Software Engineer|      2|    150000.0|
|     2|  tyrion|    120000|     25|       Programmer|      4|    180000.0|
|     3|     jon|     51000|     37|  System Engineer|      4|     76500.0|
|     4|daenerys|     70000|     31|        Developer|      1|    105000.0|
|     5|    Andy|     20000|     41| Senior Developer|      2|     30000.0|
|     6|    Luis|     40000|     25|        Developer|      3|     60000.0|
|     7|  Keshav|     50000|     36|       Programmer|      2|     75000.0|
|     8|   david|     60000|     42|  System Engineer|      1|     90000.0|
|     9|  Madhav|     40000|     22|Software Engineer|      3|     60000.0|
|    10|   Jadav|     70000|     32|Software Engineer|   NULL|    105000.0|
+------+--------+----------+-------+-----------------+-------+------------+

In [40]:
hiked_salary.show()

# withColumn() to type cast existing column
type_casted_column = hiked_salary.withColumn("emp_salary", hiked_salary["emp_salary"].cast("Float"))
type_casted_column.show()

+------+--------+----------+-------+-----------------+-------+------------+
|emp_id|emp_name|emp_salary|emp_age|  emp_designation|dept_id|hiked_salary|
+------+--------+----------+-------+-----------------+-------+------------+
|     1|   Edith|    100000|     35|Software Engineer|      2|    150000.0|
|     2|  tyrion|    120000|     25|       Programmer|      4|    180000.0|
|     3|     jon|     51000|     37|  System Engineer|      4|     76500.0|
|     4|daenerys|     70000|     31|        Developer|      1|    105000.0|
|     5|    Andy|     20000|     41| Senior Developer|      2|     30000.0|
|     6|    Luis|     40000|     25|        Developer|      3|     60000.0|
|     7|  Keshav|     50000|     36|       Programmer|      2|     75000.0|
|     8|   david|     60000|     42|  System Engineer|      1|     90000.0|
|     9|  Madhav|     40000|     22|Software Engineer|      3|     60000.0|
|    10|   Jadav|     70000|     32|Software Engineer|   NULL|    105000.0|
+------+--------+----------+-------+-----------------+-------+------------+

+------+--------+----------+-------+-----------------+-------+------------+
|emp_id|emp_name|emp_salary|emp_age|  emp_designation|dept_id|hiked_salary|
+------+--------+----------+-------+-----------------+-------+------------+
|     1|   Edith|  100000.0|     35|Software Engineer|      2|    150000.0|
|     2|  tyrion|  120000.0|     25|       Programmer|      4|    180000.0|
|     3|     jon|   51000.0|     37|  System Engineer|      4|     76500.0|
|     4|daenerys|   70000.0|     31|        Developer|      1|    105000.0|
|     5|    Andy|   20000.0|     41| Senior Developer|      2|     30000.0|
|     6|    Luis|   40000.0|     25|        Developer|      3|     60000.0|
|     7|  Keshav|   50000.0|     36|       Programmer|      2|     75000.0|
|     8|   david|   60000.0|     42|  System Engineer|      1|     90000.0|
|     9|  Madhav|   40000.0|     22|Software Engineer|      3|     60000.0|
|    10|   Jadav|   70000.0|     32|Software Engineer|   NULL|    105000.0|
+------+--------+----------+-------+-----------------+-------+------------+

In [41]:
type_casted_column.show()

# withColumn() to update data of existing column 
updated_salary = type_casted_column.withColumn("hiked_salary", type_casted_column["hiked_salary"]*0.75)
updated_salary.show()

+------+--------+----------+-------+-----------------+-------+------------+
|emp_id|emp_name|emp_salary|emp_age|  emp_designation|dept_id|hiked_salary|
+------+--------+----------+-------+-----------------+-------+------------+
|     1|   Edith|  100000.0|     35|Software Engineer|      2|    150000.0|
|     2|  tyrion|  120000.0|     25|       Programmer|      4|    180000.0|
|     3|     jon|   51000.0|     37|  System Engineer|      4|     76500.0|
|     4|daenerys|   70000.0|     31|        Developer|      1|    105000.0|
|     5|    Andy|   20000.0|     41| Senior Developer|      2|     30000.0|
|     6|    Luis|   40000.0|     25|        Developer|      3|     60000.0|
|     7|  Keshav|   50000.0|     36|       Programmer|      2|     75000.0|
|     8|   david|   60000.0|     42|  System Engineer|      1|     90000.0|
|     9|  Madhav|   40000.0|     22|Software Engineer|      3|     60000.0|
|    10|   Jadav|   70000.0|     32|Software Engineer|   NULL|    105000.0|
+------+--------+----------+-------+-----------------+-------+------------+

+------+--------+----------+-------+-----------------+-------+------------+
|emp_id|emp_name|emp_salary|emp_age|  emp_designation|dept_id|hiked_salary|
+------+--------+----------+-------+-----------------+-------+------------+
|     1|   Edith|  100000.0|     35|Software Engineer|      2|    112500.0|
|     2|  tyrion|  120000.0|     25|       Programmer|      4|    135000.0|
|     3|     jon|   51000.0|     37|  System Engineer|      4|     57375.0|
|     4|daenerys|   70000.0|     31|        Developer|      1|     78750.0|
|     5|    Andy|   20000.0|     41| Senior Developer|      2|     22500.0|
|     6|    Luis|   40000.0|     25|        Developer|      3|     45000.0|
|     7|  Keshav|   50000.0|     36|       Programmer|      2|     56250.0|
|     8|   david|   60000.0|     42|  System Engineer|      1|     67500.0|
|     9|  Madhav|   40000.0|     22|Software Engineer|      3|     45000.0|
|    10|   Jadav|   70000.0|     32|Software Engineer|   NULL|     78750.0|
+------+--------+----------+-------+-----------------+-------+------------+

In [42]:
updated_salary.show()

from pyspark.sql.functions import lit

# withColumn() to add new column
added_column = updated_salary.withColumn("country", lit("India"))
added_column.show()

+------+--------+----------+-------+-----------------+-------+------------+
|emp_id|emp_name|emp_salary|emp_age|  emp_designation|dept_id|hiked_salary|
+------+--------+----------+-------+-----------------+-------+------------+
|     1|   Edith|  100000.0|     35|Software Engineer|      2|    112500.0|
|     2|  tyrion|  120000.0|     25|       Programmer|      4|    135000.0|
|     3|     jon|   51000.0|     37|  System Engineer|      4|     57375.0|
|     4|daenerys|   70000.0|     31|        Developer|      1|     78750.0|
|     5|    Andy|   20000.0|     41| Senior Developer|      2|     22500.0|
|     6|    Luis|   40000.0|     25|        Developer|      3|     45000.0|
|     7|  Keshav|   50000.0|     36|       Programmer|      2|     56250.0|
|     8|   david|   60000.0|     42|  System Engineer|      1|     67500.0|
|     9|  Madhav|   40000.0|     22|Software Engineer|      3|     45000.0|
|    10|   Jadav|   70000.0|     32|Software Engineer|   NULL|     78750.0|
+------+--------+----------+-------+-----------------+-------+------------+

+------+--------+----------+-------+-----------------+-------+------------+-------+
|emp_id|emp_name|emp_salary|emp_age|  emp_designation|dept_id|hiked_salary|country|
+------+--------+----------+-------+-----------------+-------+------------+-------+
|     1|   Edith|  100000.0|     35|Software Engineer|      2|    112500.0|  India|
|     2|  tyrion|  120000.0|     25|       Programmer|      4|    135000.0|  India|
|     3|     jon|   51000.0|     37|  System Engineer|      4|     57375.0|  India|
|     4|daenerys|   70000.0|     31|        Developer|      1|     78750.0|  India|
|     5|    Andy|   20000.0|     41| Senior Developer|      2|     22500.0|  India|
|     6|    Luis|   40000.0|     25|        Developer|      3|     45000.0|  India|
|     7|  Keshav|   50000.0|     36|       Programmer|      2|     56250.0|  India|
|     8|   david|   60000.0|     42|  System Engineer|      1|     67500.0|  India|
|     9|  Madhav|   40000.0|     22|Software Engineer|      3|     45000.0|  India|
|    10|   Jadav|   70000.0|     32|Software Engineer|   NULL|     78750.0|  India|
+------+--------+----------+-------+-----------------+-------+------------+-------+

In [43]:
# repartition()
repartitioned_data = added_column.rdd.repartition(6)
repartitioned_data.toDF().show()

# getNumPartitions()
repartitioned_data.getNumPartitions()

+------+--------+----------+-------+-----------------+-------+------------+-------+
|emp_id|emp_name|emp_salary|emp_age|  emp_designation|dept_id|hiked_salary|country|
+------+--------+----------+-------+-----------------+-------+------------+-------+
|     1|   Edith|  100000.0|     35|Software Engineer|      2|    112500.0|  India|
|     2|  tyrion|  120000.0|     25|       Programmer|      4|    135000.0|  India|
|     3|     jon|   51000.0|     37|  System Engineer|      4|     57375.0|  India|
|     4|daenerys|   70000.0|     31|        Developer|      1|     78750.0|  India|
|     5|    Andy|   20000.0|     41| Senior Developer|      2|     22500.0|  India|
|     6|    Luis|   40000.0|     25|        Developer|      3|     45000.0|  India|
|     7|  Keshav|   50000.0|     36|       Programmer|      2|     56250.0|  India|
|     8|   david|   60000.0|     42|  System Engineer|      1|     67500.0|  India|
|     9|  Madhav|   40000.0|     22|Software Engineer|      3|     45000.0|  India|
|    10|   Jadav|   70000.0|     32|Software Engineer|   NULL|     78750.0|  India|
+------+--------+----------+-------+-----------------+-------+------------+-------+

6

In [44]:
# pyspark SQL queries
repartitioned_data.toDF().createOrReplaceTempView("employee")
spark_session.sql("select emp_name, emp_salary, emp_age, hiked_salary from employee where emp_age < 32 AND hiked_salary > 50000").show()

+--------+----------+-------+------------+
|emp_name|emp_salary|emp_age|hiked_salary|
+--------+----------+-------+------------+
|  tyrion|  120000.0|     25|    135000.0|
|daenerys|   70000.0|     31|     78750.0|
+--------+----------+-------+------------+

In [45]:
from pyspark.sql.types import StructType, StructField, StringType, IntegerType, FloatType

data = [
    ("James", "", "Smith", 36636, "M", 3000),
    ("Michael", "Rose", "", 40288, "M", 4000),
    ("Robert", "","Williams", 42114, "M", 4000),
    ("Maria", "Anne", "Jones", 39192, "F", 4000),
    ("Jen", "Mary", "Brown", 49192, "F", -1)
  ]

schema = StructType([
    StructField("firstname", StringType(), True),
    StructField("middlename", StringType(), True),
    StructField("lastname", StringType(), True),
    StructField("id", IntegerType(), True),
    StructField("gender", StringType(), True),
    StructField("salary", IntegerType(), True),
])

In [46]:
new_df = spark_session.createDataFrame(data, schema=schema)
new_df.show()

+---------+----------+--------+-----+------+------+
|firstname|middlename|lastname|   id|gender|salary|
+---------+----------+--------+-----+------+------+
|    James|          |   Smith|36636|     M|  3000|
|  Michael|      Rose|        |40288|     M|  4000|
|   Robert|          |Williams|42114|     M|  4000|
|    Maria|      Anne|   Jones|39192|     F|  4000|
|      Jen|      Mary|   Brown|49192|     F|    -1|
+---------+----------+--------+-----+------+------+

# Working with User Defined Function (UDF)

In [47]:
from pyspark.sql.functions import udf, col

data = [
    {"first_name": "srikanth", "last_name": "m s", "age": 27, "gender": "male"},
    {"first_name": "abc", "last_name": "xyz", "age": 37, "gender": "female"},
]

test_df = spark_session.createDataFrame(data)

def age_differentiator(age):
    if age < 30: 
        return True
    else:
        return False
    
age_differentiator_udf =  udf(age_differentiator)
test_df.select(col("first_name"), col("last_name"), col("age"),
               col("gender"), age_differentiator_udf(col("age")).alias("young?")).show()

+----------+---------+---+------+------+
|first_name|last_name|age|gender|young?|
+----------+---------+---+------+------+
|  srikanth|      m s| 27|  male|  true|
|       abc|      xyz| 37|female| false|
+----------+---------+---+------+------+

# RDD Transformations

In [48]:
# RDDs are immutable which means once you make changes to RDDS you should assign it to new RDDS since it can update existing RDDS

text_data = "Hello this is srikanth and i am playing with spark and also learning spark RDD"

raw_data = text_data.split(" ")

rdd_data = spark_session.sparkContext.parallelize(raw_data)

rdd_list = rdd_data.collect()

print(rdd_list)

['Hello', 'this', 'is', 'srikanth', 'and', 'i', 'am', 'playing', 'with', 'spark', 'and', 'also', 'learning', 'spark', 'RDD']

In [49]:
# distinct() transformations to get distinct RDDS and collect() to collect resultant data as list

distinct_rdd = rdd_data.distinct().collect()

print(distinct_rdd)

['and', 'is', 'am', 'spark', 'this', 'Hello', 'srikanth', 'playing', 'with', 'learning', 'i', 'also', 'RDD']

In [50]:
# filter() transformations for spark RDD

def wordStartsWith(word, letter):
    return word.startswith(letter)

filtered_rdd = rdd_data.filter(lambda word: wordStartsWith(word, 's'))
filtered_rdd_list = filtered_rdd.collect()
print(filtered_rdd_list)

['srikanth', 'spark', 'spark']

In [51]:
# map() transformations on RDD

num_data = [1, 2, 3, 4, 5, 6]
num_rdd = spark_session.sparkContext.parallelize(num_data)

mapped_rdd = num_rdd.map(lambda num: [num, num+num, num*num, num/num]).collect()

for data in mapped_rdd:
    print(data)

[1, 2, 1, 1.0]
[2, 4, 4, 1.0]
[3, 6, 9, 1.0]
[4, 8, 16, 1.0]
[5, 10, 25, 1.0]
[6, 12, 36, 1.0]

In [52]:
# flatMap() transformation on RDD

rdd_data.flatMap(lambda word: list(word)).take(15)

['H', 'e', 'l', 'l', 'o', 't', 'h', 'i', 's', 'i', 's', 's', 'r', 'i', 'k']

In [53]:
# sortByKey() RDD transformation

countries = [('India', 91), ('USA', 12), ('Australia', 25)]
countries_rdd = spark_session.sparkContext.parallelize(countries)

sorted_countries_list = countries_rdd.sortByKey(ascending=True).collect()
print(sorted_countries_list)
print("*"*50)

# using both map() and sortByKey() together
sorted_countries_list = countries_rdd.map(lambda countries_rdd: (countries_rdd[1], countries_rdd[0])) \
                                     .sortByKey(ascending=True).collect()
print(sorted_countries_list)
print()

[('Australia', 25), ('India', 91), ('USA', 12)]
**************************************************
[(12, 'USA'), (25, 'Australia'), (91, 'India')]

# RDD Actions

In [54]:
# reduce() action on RDD

def getSum(a, b):
    print(a, b)
    return a+b

num = [2,4,6,8,10]
num_rdd = spark_session.sparkContext.parallelize(num)

res = num_rdd.reduce(lambda x, y: getSum(x, y))
print("*"*50)
print(res)

2 4
6 6
12 8
20 10
**************************************************
30